tony-cloud/STM32_duino/STM32/boards.txt
BluePill.menu.upload_method.serialMethod=SerialUART1 [TX/PA9, RX/PA10, BOOT0=1]
BluePill.menu.upload_method.serialMethod.upload.protocol=maple_serial
BluePill.menu.upload_method.serialMethod.upload.tool=serial_upload
BluePill.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

BluePill.menu.upload_method.BMPMethod=BMP(SerialUSB)
BluePill.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
BluePill.menu.upload_method.BMPMethod.upload.tool=bmp_upload
BluePill.menu.upload_method.BMPMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

BluePill.menu.upload_method.DFUUploadMethod=USB_DFU(bootloader_0x2000 SerialUSB)
BluePill.menu.upload_method.DFUUploadMethod.upload.protocol=maple_dfu
BluePill.menu.upload_method.DFUUploadMethod.upload.tool=maple_upload
BluePill.menu.upload_method.DFUUploadMethod.build.extra_flags=-DSTM32F103CB -DVECT_TAB_OFFSET=0x2000
BluePill.menu.upload_method.DFUUploadMethod.build.ldscript={build.ldscript_pre}_bootloader_2000.ld
BluePill.menu.upload_method.DFUUploadMethod.upload.usbID=1EAF:0003
BluePill.menu.upload_method.DFUUploadMethod.upload.altID=UNUSED
BluePill.menu.upload_method.DFUUploadMethod.maximum_data_size=122880
BluePill.menu.upload_method.DFUUploadMethod.flash.maximum_size=122880
BluePill.menu.upload_method.DFUUploadMethod.ram.maximum_size=20480
BluePill.menu.upload_method.DFUUploadMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

BluePill.menu.usb.Disabled=USB_Default
BluePill.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
BluePill.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
BluePill.menu.usb.SerialMSC=Mass storage
BluePill.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
BluePill.menu.usb.Composite=Composite[CDC+MSC]
BluePill.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

BluePill.menu.serial.Automatic=Automatically selected based on upload method
BluePill.menu.serial.SerialUSB=SerialUSB
BluePill.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
BluePill.menu.serial.SerialUART1=SerialUART1
BluePill.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1

BluePill.menu.jtag_swd.default=Debug_default
BluePill.menu.jtag_swd.JTAG=JTAG [reserved: PA13, PA14, PA15, PB3, PB4]
BluePill.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
BluePill.menu.jtag_swd.SWD=SWD [debug pins reserved: PA13, PA14]
BluePill.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
BluePill.menu.jtag_swd.Disabled=Disabled [debug pins free]
BluePill.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

##################################### L152C ###########################################
# L152C board(32M)

L152C.name=L152Cx


L152C.build.core=arduino
L152C.build.board=L152C

L152C.build.mcu=cortex-m3
L152C.build.series=STM32L1

L152C.menu.subboard.L152C8=L152C8
L152C.menu.subboard.L152C8.upload.maximum_size=65536
L152C.menu.subboard.L152C8.upload.maximum_data_size=16384
L152C.menu.subboard.L152C8.build.variant=L152C
L152C.menu.subboard.L152C8.build.extra_flags=-DSTM32L152C8
L152C.menu.subboard.L152C8.build.ldscript=l152c8.ld

L152C.menu.subboard.L152CB=L152CB
L152C.menu.subboard.L152CB.upload.maximum_size=131072
L152C.menu.subboard.L152CB.upload.maximum_data_size=16384
L152C.menu.subboard.L152CB.build.variant=L152C
L152C.menu.subboard.L152CB.build.extra_flags=-DSTM32L152C8
L152C.menu.subboard.L152CB.build.ldscript=l152cb.ld

L152C.build.f_cpupre=32000000L

L152C.menu.clock_source.hsi=HSI
L152C.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

L152C.menu.clock_source.hse8m=HSE(8M)
L152C.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

L152C.menu.upload_method.STLinkMethod=STLink
L152C.menu.upload_method.STLinkMethod.upload.protocol=STLink
L152C.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

L152C.menu.upload_method.MassStorageMethod=Mass Storage
L152C.menu.upload_method.MassStorageMethod.upload.protocol=
L152C.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
L152C.menu.upload_method.MassStorageMethod.massstorage_drive=DISCOVERY

L152C.menu.usb.Disabled=Disabled USB
L152C.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
L152C.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
L152C.menu.usb.SerialMSC=Mass storage
L152C.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

L152C.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/10]
L152C.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
L152C.menu.serial.SerialUSB=SerialUSB (USB connector)
L152C.menu.serial.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
L152C.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

######################################GD103R#######################################
GD103R.name=GD32F103R
GD103R.vid.0=0x067B
GD103R.pid.0=0x2303

GD103R.build.board=F103R
GD103R.build.core=arduino
GD103R.build.series=STM32F1
GD103R.build.mcu=cortex-m3

GD103R.menu.subboard.F103RB=ALIENTEK_MINI[F103RB/SWD]
GD103R.menu.subboard.F103RB.upload.maximum_size=131072
GD103R.menu.subboard.F103RB.upload.maximum_data_size=20480
GD103R.menu.subboard.F103RB.upload.device=STM32F103RB
GD103R.menu.subboard.F103RB.build.extra_flags=-DSTM32F103RB
GD103R.menu.subboard.F103RB.build.variant=ATKMINI_F103R
GD103R.menu.subboard.F103RB.build.board=ATKMINI_F103RB
GD103R.menu.subboard.F103RB.build.ldscript=f103xB.ld
GD103R.menu.subboard.F103RB.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103R.menu.subboard.F103RB.massstorage_drive=NUCLEO

GD103R.menu.subboard.F103RE=ALIENTEK_MINI[F103RE/SWD]
GD103R.menu.subboard.F103RE.upload.maximum_size=524288
GD103R.menu.subboard.F103RE.upload.maximum_data_size=65536
GD103R.menu.subboard.F103RE.upload.device=STM32F103RE
GD103R.menu.subboard.F103RE.build.extra_flags=-DSTM32F103RE
GD103R.menu.subboard.F103RE.build.variant=ATKMINI_F103R
GD103R.menu.subboard.F103RE.build.board=ATKMINI_F103RE
GD103R.menu.subboard.F103RE.build.ldscript=f103xE.ld
GD103R.menu.subboard.F103RE.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103R.menu.subboard.F103RE.massstorage_drive=NUCLEO

GD103R.menu.subboard.F103RE1=GENERIC_F103RE[LED PC13/JTAG]
GD103R.menu.subboard.F103RE1.upload.maximum_size=524288
GD103R.menu.subboard.F103RE1.upload.maximum_data_size=65536
GD103R.menu.subboard.F103RE1.upload.device=STM32F103RE
GD103R.menu.subboard.F103RE1.build.extra_flags=-DSTM32F103RE
GD103R.menu.subboard.F103RE1.build.variant=F103R_GD
GD103R.menu.subboard.F103RE1.build.board=GENERIC_F103RE
GD103R.menu.subboard.F103RE1.build.ldscript=f103xE.ld
GD103R.menu.subboard.F103RE1.massstorage_drive=NUCLEO

GD103R.menu.osc_speed.speed_08m=8M (HSE)
GD103R.menu.osc_speed.speed_08m.build.osc=-DHSE_VALUE=8000000 -DHSE_STARTUP_TIMEOUT=((uint32_t)0xFFFF)

GD103R.menu.osc_speed.speed_12m=12M (HSE)
GD103R.menu.osc_speed.speed_12m.build.osc=-DHSE_VALUE=12000000 -DOSC=12 -DHSE_STARTUP_TIMEOUT=((uint32_t)0xFFFF)

