tony-cloud/STM32_duino/STM32/boards.txt
GD103R.menu.osc_speed.speed_hsi=8M (HSI)
GD103R.menu.osc_speed.speed_hsi.build.osc=-DUSE_HSI

GD103R.menu.cpu_speed.F72=72M(default)
GD103R.menu.cpu_speed.F72.build.f_cpu=72000000L -DGD32F10X  {build.osc}

GD103R.menu.cpu_speed.F96=96M(Stable)
GD103R.menu.cpu_speed.F96.build.f_cpu=96000000L -DGD32F10X {build.osc}

GD103R.menu.cpu_speed.F120=120M(overdrive)
GD103R.menu.cpu_speed.F120.build.f_cpu=120000000L -DGD32F10X  {build.osc}


#---------------------------- UPLOAD METHODS ---------------------------
GD103R.menu.upload_method.jLinkMethod=JLink
GD103R.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
GD103R.menu.upload_method.jLinkMethod.upload.protocol=jlink
GD103R.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R.menu.upload_method.STLinkMethod=STLink
GD103R.menu.upload_method.STLinkMethod.upload.protocol=STLink
GD103R.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
GD103R.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
GD103R.menu.upload_method.MassStorageMethod.upload.protocol=
GD103R.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

GD103R.menu.upload_method.serialMethod=Serial[TX/PA9, RX/PA10, BOOT0=1]
GD103R.menu.upload_method.serialMethod.upload.protocol=maple_serial
GD103R.menu.upload_method.serialMethod.upload.tool=serial_upload
GD103R.menu.upload_method.serialMethod.upload.altID=UNUSED
GD103R.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R.menu.upload_method.serialMethod1=Serial[pl2302 AutoLoad]
GD103R.menu.upload_method.serialMethod1.upload.protocol=maple_serial
GD103R.menu.upload_method.serialMethod1.upload.tool=serial_upload
GD103R.menu.upload_method.serialMethod1.upload.altID=PL2303
GD103R.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
GD103R.menu.upload_method.serialMethod2.upload.protocol=maple_serial
GD103R.menu.upload_method.serialMethod2.upload.tool=serial_upload
GD103R.menu.upload_method.serialMethod2.upload.altID=CH340
GD103R.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
GD103R.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
GD103R.menu.upload_method.BMPMethod.upload.tool=bmp_upload

GD103R.menu.usb.Disabled=Disabled USB
GD103R.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
GD103R.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
GD103R.menu.usb.SerialMSC=Mass storage
GD103R.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
GD103R.menu.usb.Composite=Composite[CDC+MSC]
GD103R.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD


GD103R.menu.serial.Automatic=Automatically selected based on upload method
GD103R.menu.serial.SerialUART1=SerialUART1
GD103R.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
GD103R.menu.serial.SerialUSB=SerialUSB
GD103R.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

GD103R.menu.jtag_swd.default=Debug_default
GD103R.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
GD103R.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
GD103R.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14, PA13]
GD103R.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103R.menu.jtag_swd.Disabled=Disabled [debug pins free]
GD103R.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

######################################F103R#######################################
F103R.name=F103R
F103R.vid.0=0x067B
F103R.pid.0=0x2303

F103R.build.board=F103R
F103R.build.core=arduino
F103R.build.series=STM32F1
F103R.build.mcu=cortex-m3

F103R.menu.subboard.F103RB=ALIENTEK_MINI[F103RB/SWD]
F103R.menu.subboard.F103RB.upload.maximum_size=131072
F103R.menu.subboard.F103RB.upload.maximum_data_size=20480
F103R.menu.subboard.F103RB.upload.device=STM32F103RB
F103R.menu.subboard.F103RB.build.extra_flags=-DSTM32F103RB
F103R.menu.subboard.F103RB.build.variant=ATKMINI_F103R
F103R.menu.subboard.F103RB.build.board=ATKMINI_F103RB
F103R.menu.subboard.F103RB.build.ldscript=f103xB.ld
F103R.menu.subboard.F103RB.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103R.menu.subboard.F103RB.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RE=ALIENTEK_MINI[F103RE/SWD]
F103R.menu.subboard.F103RE.upload.maximum_size=524288
F103R.menu.subboard.F103RE.upload.maximum_data_size=65536
F103R.menu.subboard.F103RE.upload.device=STM32F103RE
F103R.menu.subboard.F103RE.build.extra_flags=-DSTM32F103RE
F103R.menu.subboard.F103RE.build.variant=ATKMINI_F103R
F103R.menu.subboard.F103RE.build.board=ATKMINI_F103RE
F103R.menu.subboard.F103RE.build.ldscript=f103xE.ld
F103R.menu.subboard.F103RE.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103R.menu.subboard.F103RE.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RC=GENERIC_F103RC[LED PC13/JTAG]
F103R.menu.subboard.F103RC.upload.maximum_size=262144
F103R.menu.subboard.F103RC.upload.maximum_data_size=49152
F103R.menu.subboard.F103RC.upload.device=STM32F103RC
F103R.menu.subboard.F103RC.build.extra_flags=-DSTM32F103RC
F103R.menu.subboard.F103RC.build.variant=F103R
F103R.menu.subboard.F103RC.build.board=GENERIC_F103RC
F103R.menu.subboard.F103RC.build.ldscript=f103xC.ld
F103R.menu.subboard.F103RC.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RE1=GENERIC_F103RE[LED PC13/JTAG]
F103R.menu.subboard.F103RE1.upload.maximum_size=524288
F103R.menu.subboard.F103RE1.upload.maximum_data_size=65536
F103R.menu.subboard.F103RE1.upload.device=STM32F103RE
F103R.menu.subboard.F103RE1.build.extra_flags=-DSTM32F103RE
F103R.menu.subboard.F103RE1.build.variant=F103R
F103R.menu.subboard.F103RE1.build.board=GENERIC_F103RE
F103R.menu.subboard.F103RE1.build.ldscript=f103xE.ld
F103R.menu.subboard.F103RE1.massstorage_drive=NUCLEO

