tony-cloud/STM32_duino/STM32/boards.txt
F103R.menu.subboard.F103RF=GENERIC_F103RF[LED PC13/JTAG]
F103R.menu.subboard.F103RF.upload.maximum_size=786432
F103R.menu.subboard.F103RF.upload.maximum_data_size=98304
F103R.menu.subboard.F103RF.upload.device=STM32F103RF
F103R.menu.subboard.F103RF.build.extra_flags=-DSTM32F103RF
F103R.menu.subboard.F103RF.build.variant=F103R
F103R.menu.subboard.F103RF.build.board=GENERIC_F103RF
F103R.menu.subboard.F103RF.build.ldscript=f103xF.ld
F103R.menu.subboard.F103RF.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RG=GENERIC_F103RG[LED PC13/JTAG]
F103R.menu.subboard.F103RG.upload.maximum_size=1048576
F103R.menu.subboard.F103RG.upload.maximum_data_size=98304
F103R.menu.subboard.F103RG.pload.device=STM32F103RG
F103R.menu.subboard.F103RG.build.extra_flags=-DSTM32F103RG
F103R.menu.subboard.F103RG.build.variant=F103R
F103R.menu.subboard.F103RG.build.board=GENERIC_F103RG
F103R.menu.subboard.F103RG.build.ldscript=f103xG.ld
F103R.menu.subboard.F103RG.massstorage_drive=NUCLEO

F103R.menu.osc_speed.speed_08m=8M(HSE)_72M
F103R.menu.osc_speed.speed_08m.build.f_cpu=72000000L -DHSE_VALUE=8000000
F103R.menu.osc_speed.speed_hsi=8M(HSI)_48M
F103R.menu.osc_speed.speed_hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
F103R.menu.upload_method.STLinkMethod=STLink 
F103R.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103R.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103R.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103R.menu.upload_method.jLinkMethod=JLink
F103R.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103R.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103R.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103R.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F103R.menu.upload_method.MassStorageMethod.upload.protocol=
F103R.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F103R.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1, BOOT1=0]
F103R.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103R.menu.upload_method.serialMethod.upload.tool=serial_upload
F103R.menu.upload_method.serialMethod.upload.altID=UNUSED
F103R.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103R.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F103R.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103R.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103R.menu.upload_method.serialMethod1.upload.altID=PL2303
F103R.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103R.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103R.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103R.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103R.menu.upload_method.serialMethod2.upload.altID=CH340
F103R.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103R.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103R.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103R.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F103R.menu.usb.Disabled=Disabled USB
F103R.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F103R.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103R.menu.usb.SerialMSC=Mass storage
F103R.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103R.menu.usb.Composite=Composite[CDC+MSC]
F103R.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103R.menu.serial.SerialUART1=SerialUART1
F103R.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103R.menu.serial.SerialUSB=SerialUSB
F103R.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
F103R.menu.serial.Automatic=Automatically selected based on upload method

F103R.menu.jtag_swd.default=Debug_default
F103R.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
F103R.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103R.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103R.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103R.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103R.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

##################################F103V board##############################################
F103V.name=F103V
F103V.vid.0=0x067B
F103V.pid.0=0x2303

F103V.build.mcu=cortex-m3
F103V.build.board=GENERIC_F103V
F103V.build.core=arduino
F103V.build.series=STM32F1
F103V.build.f_cpu=72000000L

F103V.menu.subboard.F103VE=ArmFly_X2[F103VE PL2303/SWD]
F103V.menu.subboard.F103VE.upload.maximum_size=524288
F103V.menu.subboard.F103VE.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE.upload.device=STM32F103VE
F103V.menu.subboard.F103VE.build.extra_flags=-DSTM32F103VE
F103V.menu.subboard.F103VE.build.variant=ARMFLY_X2_F103VE
F103V.menu.subboard.F103VE.build.board=ARMFLY_X2
F103V.menu.subboard.F103VE.build.ldscript=f103xE.ld
F103V.menu.subboard.F103VE.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE.upload.protocol=maple_serial
F103V.menu.subboard.F103VE.upload.tool=serial_upload
F103V.menu.subboard.F103VE.upload.altID=PL2303
F103V.menu.subboard.F103VE.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103V.menu.subboard.F103VE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VB=GENERIC_F103VB[CH430]
F103V.menu.subboard.F103VB.upload.maximum_size=131072
F103V.menu.subboard.F103VB.upload.maximum_data_size=20480
F103V.menu.subboard.F103VB.upload.device=STM32F103VB
F103V.menu.subboard.F103VB.build.extra_flags=-DSTM32F103VB
F103V.menu.subboard.F103VB.build.variant=F103V
F103V.menu.subboard.F103VB.build.board=GENERIC_F103VB
F103V.menu.subboard.F103VB.build.ldscript=f103xB.ld
F103V.menu.subboard.F103VB.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VB.upload.protocol=maple_serial
F103V.menu.subboard.F103VB.upload.tool=serial_upload
F103V.menu.subboard.F103VB.upload.altID=CH340
F103V.menu.subboard.F103VB.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

