tony-cloud/STM32_duino/STM32/boards.txt
F103V.menu.subboard.F103VC=GENERIC_F103VC[CH430]
F103V.menu.subboard.F103VC.upload.maximum_size=262144
F103V.menu.subboard.F103VC.upload.maximum_data_size=49152
F103V.menu.subboard.F103VC.upload.device=STM32F103VC
F103V.menu.subboard.F103VC.build.extra_flags=-DSTM32F103VC
F103V.menu.subboard.F103VC.build.variant=F103V
F103V.menu.subboard.F103VC.build.board=GENERIC_F103VC
F103V.menu.subboard.F103VC.build.ldscript=f103xC.ld
F103V.menu.subboard.F103VC.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VC.upload.protocol=maple_serial
F103V.menu.subboard.F103VC.upload.tool=serial_upload
F103V.menu.subboard.F103VC.upload.altID=CH340
F103V.menu.subboard.F103VC.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VE1=GENERIC_F103VE[CH430]
F103V.menu.subboard.F103VE1.upload.maximum_size=524288
F103V.menu.subboard.F103VE1.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE1.upload.device=STM32F103VE
F103V.menu.subboard.F103VE1.build.extra_flags=-DSTM32F103VE
F103V.menu.subboard.F103VE1.build.variant=F103V
F103V.menu.subboard.F103VE1.build.board=GENERIC_F103VE
F103V.menu.subboard.F103VE1.build.ldscript=f103xE.ld
F103V.menu.subboard.F103VE1.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE1.upload.protocol=maple_serial
F103V.menu.subboard.F103VE1.upload.tool=serial_upload
F103V.menu.subboard.F103VE1.upload.altID=CH340
F103V.menu.subboard.F103VE1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VF=GENERIC_F103VF[CH340]
F103V.menu.subboard.F103VF.upload.maximum_size=786432
F103V.menu.subboard.F103VF.upload.maximum_data_size=98304
F103V.menu.subboard.F103VF.upload.device=STM32F103VF
F103V.menu.subboard.F103VF.build.extra_flags=-DSTM32F103VF
F103V.menu.subboard.F103VF.build.variant=F103V
F103V.menu.subboard.F103VF.build.board=GENERIC_F103VF
F103V.menu.subboard.F103VF.build.ldscript=f103xF.ld
F103V.menu.subboard.F103VF.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VF.upload.protocol=maple_serial
F103V.menu.subboard.F103VF.upload.tool=serial_upload
F103V.menu.subboard.F103VF.upload.altID=CH340
F103V.menu.subboard.F103VF.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VG=GENERIC_F103VG[CH340]
F103V.menu.subboard.F103VG.upload.maximum_size=1048576
F103V.menu.subboard.F103VG.upload.maximum_data_size=98304
F103V.menu.subboard.F103VG.upload.device=STM32F103VG
F103V.menu.subboard.F103VG.build.extra_flags=-DSTM32F103VG
F103V.menu.subboard.F103VG.build.variant=F103V
F103V.menu.subboard.F103VG.build.board=GENERIC_F103VG
F103V.menu.subboard.F103VG.build.ldscript=f103xG.ld
F103V.menu.subboard.F103VG.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VG.upload.protocol=maple_serial
F103V.menu.subboard.F103VG.upload.tool=serial_upload
F103V.menu.subboard.F103VG.upload.altID=CH340
F103V.menu.subboard.F103VG.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.extern_lib.NONE = NONE
F103V.menu.extern_lib.STemWin =STemWin
F103V.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
F103V.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F103V.menu.extern_lib.STemWinOS =STemWin_OS
F103V.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
F103V.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

#---------------------------- UPLOAD METHODS ---------------------------
F103V.menu.upload_method.default=Upload default

F103V.menu.upload_method.STLinkMethod=STLink
F103V.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103V.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103V.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103V.menu.upload_method.jLinkMethod=JLink
F103V.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103V.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103V.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103V.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F103V.menu.upload_method.MassStorageMethod.upload.protocol=
F103V.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F103V.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10, BOOT0=1]
F103V.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod.upload.altID=UNUSED
F103V.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F103V.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod1.upload.altID=PL2303
F103V.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103V.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod2.upload.altID=CH340
F103V.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103V.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103V.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F103V.menu.usb.Disabled=Disabled USB
F103V.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
F103V.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103V.menu.usb.SerialMSC=Mass storage
F103V.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103V.menu.usb.Composite=Composite[CDC+MSC]
F103V.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103V.menu.serial.defalt=Automatically selected based on upload method
F103V.menu.serial.SerialUART1=SerialUART1
F103V.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103V.menu.serial.SerialUSB=SerialUSB
F103V.menu.serial.SerialUART2=SerialUART2
F103V.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F103V.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

F103V.menu.jtag_swd.default=Debug_default
F103V.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4, PB3,PA15,PA14,PA13]
F103V.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103V.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103V.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103V.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103V.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED


###################################### F103Z ##########################################
F103Z.name=F103Z
F103Z.build.mcu=cortex-m3
F103Z.build.board=F103Z
F103Z.build.core=arduino
F103Z.build.series=STM32F1
F103Z.build.f_cpu=72000000L

F103Z.menu.subboard.F103ZE1=HY_RedBull_V2[F103ZE JLink]
F103Z.menu.subboard.F103ZE1.upload.maximum_size=524288
F103Z.menu.subboard.F103ZE1.upload.maximum_data_size=524288
F103Z.menu.subboard.F103ZE1.upload.device=STM32F103ZE
F103Z.menu.subboard.F103ZE1.build.variant=REDBULL_V2_F103ZE
F103Z.menu.subboard.F103ZE1.build.board=REDBULL
F103Z.menu.subboard.F103ZE1.build.extra_flags=-DSTM32F103ZE
F103Z.menu.subboard.F103ZE1.build.ldscript=f103xE.ld
F103Z.menu.subboard.F103ZE1.massstorage_drive=NUCLEO
F103Z.menu.subboard.F103ZE1.upload.protocol=jlink
F103Z.menu.subboard.F103ZE1.upload.tool=jlink_upload
F103Z.menu.subboard.F103ZE1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1


